---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetY
source: html/82ae2419-0650-d52f-f787-9a7dc6d25d04.htm
---
# Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".